Revit 2027 API
PathOfTravel.Update Method
 Updates the path of travel by recalculating the path between the original start and end points.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PathOfTravelCalculationStatus Update()
Public Function Update As PathOfTravelCalculationStatus
public:
PathOfTravelCalculationStatus Update()
member Update : unit -> PathOfTravelCalculationStatus
Return Value
PathOfTravelCalculationStatus
 The status result of the recalculation.
Exceptions
Exception | Condition
InvalidOperationException |  This functionality is not available in Revit LT.
Remarks
 If recalculation results in failure, Revit will post a warning.
See Also
Reference
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace